Repository: chubakur/wizards-magic2
Catalog: languages/*/LC_MESSAGES/cards.po
Languages: de

source: Causes 200% of damage to fire creatures. Gives owner 1 Water in the beginning of owner's turn. Casting Sea of Sacred increases owner's Water by 1 and reduces Fire by 1.
de: Verursacht 200% Schaden bei Feuer Kreaturen. Gibt dem Besitzer 1 Wasser zu beginn seiner Runde. Beschwörung von See der Heiligen erhöht das Wasser des Besitzers um 1 und senkt das Feuer um 1.

source: Attacks both adjacent slots. Reduces owner`s Water by 2 every turn. CAST: Consumes friendly unit, receiving up to 50% of his health.
de: Greift auch beide angrenzenden Felder an. Verringert Wasser des Besitzers jede Runde um 2. Effekt wirken: Verschlingt eine eigene Einheit, erhält bis zu 50% seines Lebens.

source: One of the toughest Elementals. Health itself for 3 whenever any player casts water spell of summons water creature. Attack equal to owner`s Water.
de: Eines der zähesten Elementare. Heilt sich selbst um 3, wenn ein beliebiger Spieler einen Wasserspruch spricht oder eine Wasserkreatur beschwört. Angriff entspricht der Wassermenge des Besitzers.

source: When attacking, each enemy creature suffers 1 damage in addition to standard attack. Casting Curing heals owner for 4. In exchange, owner loses 1 Water. Cannot be cast if owner's Water less than 6.
de: Beim Angriff erhält jede gegnerische Kreatur einen Schaden, zusätzlich zum Grundangriff. Effekt wirken: heilt den Besitzer um 4. Dafür verliert der Besitzer 1 Wasser. Kann nicht gewirkt werden, wenn der Besitzer über weniger als 6 Wasser verfügt.

source: Reduces all damage done to owner by 50%. Suffers 200% damage from fire.
de: Reduziert sämlichen Schaden, der dem Besitzer zugefügt wird, um 50%. Erhält 200% Schaden von Feuer.

source: Every time anyone casts Water spell or summons Water creature, opponent suffers 4 damage and owner gains 2 health.
de: Jedes Mal, wenn meand einen Wasserspruch zaubert oder eine Wasserkreatur beschwört, erleidet der Gegener 4 Schaden und der Besitzer erhält 2 Leben dazu.

source: Increases Water by 2 every turn. Suffers 200% damage from fire. All damage from Water equal to 1. CAST: Casting Healing Water heals owner equal to 2*Water points. Owner loses all Water.
de: Erhöht Wasser um 2 pro Runde. Erleidet 200% Schaden durch Feuer. Sämtlicher Schaden durch Wasser beträgt 1. Effekt wirken: Wird Heilendes Wasser gewirkt, erhält der Besitzer 2*Wasser Lebenspunkte und verliert seinen gesamten Wasservorrat.

source: Doesn`t suffer from Fire and Earth spells. CAST: Whenever Demon casts Fire Bleed owner loses 1 Earth and receives 2 Fire elements.
de: Erleidet keinen Schaden durch Feuer- und Erdzauber. Effekt wirken: Immer, wenn der Dämon den Effekt wirkt, verliert der Besitzer 1 Erde und erhält 2 Feuer.

source: Damage from Water is multiplied by 2. Whenever Devil dies, owner suffers 10 damage. CAST: Sacrificing owner`s Fire creature gives 3 Fire to the owner, also healing owner by this amount.
de: Schaden durch Wasser wird mit 2 multipliziert. Wenn der Teufel stirbt, erleidet sein Besitzer 10 Schaden. Effekt wirken: Wird eine Feuerkreatur des Besitzers geopfert, erhält er 3 Feuer und wird um 3 geheilt.

source: When summoned, each enemy creature and enemy player suffers 3 damage. Red Drake Suffers no damage from Fire spells and creatures.
de: Wenn beschworen erleidet jede gegnerische Kreatur und der gegnerische Spieler je 3 Schaden. Der Rote Drache erleidet keinen Schaden durch Feuerzauber oder -kreaturen.

source: Opens fire gates. This means that both players should receive 1 additional Fire every turn. Upon dying, Firelord brings 8 damage to each player.
de: Öffnet Feuertore. Das bedeutet, dass beide Spieler 1 zusätzliches Feuer pro Runde erhalten. Wenn er stirbt, fügt der Herr des Feuers beiden Spielern je 8 Schaden zu.

source: Increases attack of all owner's creatures by 2. Increases damage from owner player's spellcastings by 2.
de: Erhöht den Angriff aller Kreaturen des Besitzers um 2. Erhöht den Schaden durch Zaubersprüche des Besitzers um 2.

source: Whenever any creature attacks Efreet, that creature suffers half of damage send back (same applies to Fire Shield spell). Uppon summoning, all enemy Water creatures suffer 6 damage. CAST: Casts Fire Shield on any owner`s creature. Costs 2 Fire. Fire Shield burns creature from inside, damaging it for 2 points per turn, unless it`s a Fire creature.
de: Wann immer eine Kreatur den Efreet angreift, wird die Hälfte ihres Schadens zurückgeworfen (gleiches gilt für den Feuerschildspruch). Beim Beschwören erleiden alle gegnerischen Wasserkreaturen 6 Schaden. Effekt wirken: Wirkt Feuerschild auf eine beliebige Kreatur des Besitzers. Kostet 2 Feuer. Das Feuerschild verbrennt die Kreatur von innen und verursacht 2 Schaden pro Runde, sofern es keine Feuerkreatur ist.

source: Fire Elemental. Immune to harmful Fire spells. When summoned, enemy player loses 3 Fire, and opposed Elemental unit suffers 9 damage. Attack equal to owner`s Fire + 3. CAST: Casts Volcano Explode. Vulcan dies, but every unit on field suffers damage equal to 50% of Vulcan`s health.
de: Feuerelementar. Immun gegen schädliche Feuerzauber. Wird er beschworen, so verliert der Gegner 3 Feuer und ein gegenüberliegender Elementar erleidet 9 Schaden. Stärke entspricht 3 + Feuer des Besitzers. Effekt wirken: Wirkt eine Vulkanexplosion. Der Vulkan stirbt und jede Einheit im Feld erleidet Schaden in Höhe von 50% der Lebenspunkte des Vulkans.

source: Attacks adjacent enemy units at a half of it`s strength.
de: Greift angrenzende gegnerische Einheiten mit der Hälfte seiner Stärke an.

source: Owner receives 1 Air at the beginning of Owners turn.
de: Besitzer erhält 1 Luft zu Beginn seines Spielzugs.

source: Increases its attack by 1 for each creature, killed on a field. CAST: Enslave Mind forces strongest enemy creature to attack it`s owner. Costs 1 Air.
de: Stärke erhöht sich um 1 für jede Kreatur, die auf dem Spielfeld stirbt. Effekt wirken: Verstand versklaven zwingt die stärkste gegnerische Kreatur, ihren Besitzer anzugreifen. Kostet 1 Luft.

source: If Phoenix was killed by Fire spell or creature, rebirth with full health.
de: Wenn der Phönix durch einen Feuerzauber oder eine Feuerkreatur getötet wird, wird er mit vollen Lebenspunkten wiedergeboren.

source: Owner receives 1 air element for each enemy creature, killed by Zeus. CAST: Strikes Lighting into choosen creature. Costs 1 Air and inflicts 8 damage. Cannot strike creatures of level 7 and highter.
de: Besitzer erhält 1 Luft für jede gegnerische Kreatur, die von Zeus getötet wird. Effekt wirken: Ein Blitz schlägt in die gewählte Kreatur ein. Kostet 1 Luft und verursacht 8 Schaden. Kann nicht gegen Kreaturen mit Stufe 7 oder höher eingesetzt werden.

source: Suffers no damage from Earth and Air spells. CAST: Casts Petrification on self, as effect turns to stone. In stone form Gargoyle reduces damage done to it by 2 . Owner loses 3 Air and 1 Earth.
de: Erhält keinen Schaden von Erd- und Luftzaubern. Effekt wirken: Wirkt Versteinerung auf sich selbst. In Steinform wird der Schaden, der dem Gargoyle zugefügt wird, um 2 reduziert. Der Besitzer verliert 3 Luft und 1 Erde.

source: Attacks casters with additional 3 damage. Only suffers 50% damage from spells. CAST: Casts Memory Loss. Target enemy creature permanently loses ability to cast. Costs 2 Air.
de: Greift Effekte wirkende Gegner mit zusätzlichen 3 Schadenspunkten an. Erleidet nur 50% Schaden von Zaubern. Effekt wirken: Zaubert Gedächtnisverlust. Gegnerische Zielkreatur verliert dauerhaft die Fähigkeit, Effekte zu wirken. Kostet 2 Luft.

source: When summoned, enemy loses 3 Air. Titan`s attack is increased by 1 for each Air creature in play. CAST: Casts Thunder Fist. All enemy Earth creatures suffer 3 damage. Owner loses 1 Air.
de: Wenn erfolgreich beschworen verliert der Gegner 3 Luft. Die Stärke des Titans wird um 1 für jede Luftkreatur im Spiel erhöht. Effekt wirken: Wirk Donnerfaust, sein Besitzer verliert 1 Luft. Alle gegnerischen Erdkreaturen erleiden 3 Schaden.

source: Increases Earth by 1 every turn. CAST: Once Satyr casts Dissolve, it dies and creature in the opposed slot suffers 5 damage. If there`s no creature, damage dealt to enemy player.
de: Erde wird jede Runde um 1 erhöht. Effekt wirken: Opfere den Satyr, um Auflösung zu wirken. Die Kreatur im gegnerischen Slot erleidet 5 Schaden. Ist dort keine Kreatur, wird der Schaden dem Gegner direkt zugefügt.

source: Regenerates 3 health every turn. While owner's Earth less than 3, it suffers 3 damage instead.
de: Regeneriert 3 Lebenspunkte pro Runde. Solang der Besitzer über weniger als 3 Erde verfügt, wird stattdessen 3 Schaden zugefügt.

source: Adjacent owner creatures attack increases by 1, and if it`s Earth creature, by 2 whenever anyone casts Earth spell of summons Earth creature.
de: Die Stärke angrenzender eigener Kreaturen wird um 2 bei Erdkreaturen bzw. um 1 bei allen anderen Kreaturen erhöht, wann immer ein Erdzauber gesprochen oder eine Erdkreatur beschworen wird.

source: Damage from all non-magical attacks and abilities equal to 1. CAST: Casts Youth of Forest, increasing owner player`s health by 5. Costs two Earth elements.
de: Schaden von allen nichtmagischen Angriffen und Fähigkeiten entspricht 1. Effekt wirken: Wirkt Jugend des Waldes, die für Kosten von 2 Erde die Gesundheit des Besitzers um 5 Lebenspunkte erhöht.

source: Attacks the same turn he was summoned(No summon sickness). CAST: Strikes magic arrow into enemy player, dealing 3 damage. Costs 1 Earth.
de: Greift in derselben Runde an, in der er beschworen wurde (keine Einsatzverzögerung). Effekt wirken: Schießt einen magischen Pfeil auf den Gegenspieler, der 3 Schaden zufügt. Kostet 1 Erde.

source: Attack equal to owner`s Earth. Increases Earth by 2 every turn. Fire spells deal additional 10 damage. CAST: Casts Stone Skin onto owner`s creature. That creature gain 1 point of defence from all attacks greater than 1.
de: Stärke entspricht dem Vorrat des Bestizers an Erde. Erhöht den Vorrat um 2 Erde pro Runde. Feuerzauber bewirken 10 zusätzlichen Schaden. Effekt wirken: Wirkt Steinhaut auf eine Kreatur des Besitzers. Diese Kreatur erhält 1 Verteidigungspunkt von allen Angriffen größer als 1.

source: Attacks opposed unit and enemy player at the same time. Casts Entangle Roots, damaging each enemy unit for 1 and losing 2 points of own health.
de: Greift gegnerische Einheit und Gegenspieler gleichzeitig an. Effekt wirken: Umschlingende Wurzeln fügen jeder gegnerischen Einheit 1 Schaden zu, kostet die Kreatur selbst jedoch 2 Lebenspunkte.

source: When attacks, poisons her target. This target will lose 2 health every turn. In the beginning og owner`s turn, Echidna hits all poisoned creatures for 1.
de: Vergiftet beim Angriff die gegnerische Kreatur. Das Ziel verliert jede Runde 2 Lebenspunkte. Zu Beginn des Spielzugs ihres Besitzers fügt Echidna jeder vergifteten Kreatur 1 Schadenspunkt zu.

source: Increases owner`s Life by 2 every turn, decreasing Death by the same amount. Decreases owner`s Life by 3 every time owner casts Death spells.
de: Erhöht den Vorrat des Besitzers an Leben um 2 pro Runde und reduziert den Vorrat an Tod um denselben Betrag. Reduziert den Vorrat des Besitzers an Leben um 3, wann immer der Besitzer einen Todeszauber spricht.

source: Brings 300% of damage to undead creatures. CAST: Casts Exorcism. Destroys any undead, but suffers 10 damage himself. Owner also loses 2 Life as a cost of this holy casting.
de: Fügt untoten Kreaturen 300% Schaden zu. Effekt wirken: Wirkt Exozismus. Zerstört eine beliebige untote Kreatur und erleidet dabei selbst 10 Schaden. Der Besitzer verliert 2 Leben als Resultat dieses heiligen Ritus.

source: When summoned, each owner`s creature is healed for 3. Also, it destroys harmful spell effects from each of them. CAST: Holy Strike deals 5 damage to a target creature. If it is undead creature, Pegasus also suffer 3 damage homself. Costs 2 Life.
de: Wenn beschworen, wird jede Kreatur des Besitzers um 3 geheilt. Zerstört außerdem schädliche Sprucheffekte von ihnen. Effekt wirken: Heiliger Schlag fügt der Zielkreatur 5 Schaden zu. Wenn es eine untote Kreatur ist, erleidet Pegasus selbst 3 Schaden. Der Effekt kostet 2 Leben-Elemente.

source: Unicorn reduces damage from spells to owner's creatures by 50%. Cures poison from owner's creatures. Casts Unicorn Aura. This Aura destroys useful spell effects from enemy creatures. Costs 2 Life.
de: Das Einhorn reduziert Schäden von Sprüchen gegen Kreaturen des Besitzers um 50%. Heilt Vergiftungen von Kreaturen des Besitzers. Effekt wirken: Die Aura des Einhorns zerstört positive Sprucheffekte von gegnerischen Kreaturen. Kostet 2 Leben.

source: Steals 2 owner's Life and gives owner 1 Death in the beginning of owner's turn. Serves Death. Once cast, Apostate permanently turns into a Banshee. Banshee restores only 1/2 of normal health.
de: Stiehlt dem Besitzer 2 Leben-Elemente und gibt ihm 1 Tod-Element zu Beginn seiner Runde. Effekt wirken: Wird Todesdienst gewirkt, verwandelt sich der Apostate dauerhaft in einen Banshee. Der Banshee regeneriert nur die Hälfte seiner normalen Gesundheit.

source: Whenever owner player loses health, Magic Healer health player by this amount, losing hit points equally.
de: Wann immer der Besitzer Lebenspunkte verliert, wird er vom magischen Heiler geheilt, der diese Lebenspunkte an Spieler statt verliert.

source: When Chimera is on a field, every spell casting costs 50% less for the owner. Whenever you summon creature, you gain health equal to this creature's level.
de: Wenn sich Chimäre im Spiel befindet, kostet jeder Zauberspruch des Besitzers 50%. Wann immer der Spieler eine Kreatur beschwört, erhält er Lebenspunkte in Höhe der Kreaturenstufe.

source: Eats enemies corpses - every time if kills enemy creature, totally health and his health increases by 3.
de: Isst gegnerische Leichen - immer wenn er eine gegnerische Kreatur tötet, erhöhen sich seine maximalen und aktuellen Lebenspunkte um 3.

source: Whenever attacked by a creature, suffers 50% less damage, and owner suffers other 50% damage. When suffers from spell, Ghost recieves 200% of normal damage. Casts Bloody Ritual. As a result, owner loses 5 health, but receives one Death.
de: Erleidet 50% weniger Schaden, wenn von gegnerischer Kreatur angegriffen. Der Besitzer erleidet die übrigen 50% Schaden. Wenn von einem Spruch betroffen, verliert der Geist 200% des normalen Schadens. Effekt wirken: Wird das Blutige Ritual gewirkt, verliert sein Besitzer 5 Lebenspunkte und erhält 1 Tod-Element.

source: When attacks living creature, restores health equal to 50% of damage dealt. Maximum 30 health.
de: Heilt sich um 50% des zugefügten Schadens, wenn er eine lebende Kreatur angreift. Maximal 30 Lebenspunkte.

source: When dies, becomes a ghost. CAST: Casts Blood Rage on self. Strikes twice as hard this turn, but owner loses 3 Death points on casting.
de: Wenn er stirbt, wird er zum Geist. Effekt wirken: Wirkt Blutrausch auf sich selbst. Angriff wird in dieser Runde verdoppelt, wobei der Besitzer 3 Tod verliert.

source: When summoned, deals 8 damage to enemy. Once it attacks enemy player, dies and enemy player suffers 10 points of extra damage. If Banshee dies from other creature or spell, enemy player doesn't suffer.
de: Wenn er beschworen wird, fügt er dem Gegenspieler 8 Schaden zu. Wenn er den Gegenspieler angreift, stirbt er und der Gegenspieler erleidet 10 Schaden extra. Wird der Banshee von einer gegnerischen Kreatur getötet, erleidet der Gegenspieler keinen Extraschaden.

source: Whenever creature dies, increases owner`s Death by one. CAST: Consumes target enemy creature of level 3 or less. Owner player loses 3 Death elements.
de: Wann immer eine Kreatur stirbt, erhöht sich der Vorrat an Tod-Elementen um eins. Effekt wirken: Verschlingt gegnerische Zielkreatur von Level 3 oder geringer. Besitzer verliert 3 Tod-Elemente.

source: Whenever creature dies, Darklord heals owner for 3 and regenerates self for 2. Steal Spell steals all spell effects from any enemy creature, DarkLord receives these spells. Owner loses 1 Death.
de: Wann immer eine Kreatur stirbt, heilt der Dunkle Herr seinen Besitzer um 3 und regeneriert sich selbst um 2. Effekt wirken: Spruchdiebstahl stiehlt alle Sprucheffekte von einer gegnerischen Kreatur. Der Dunkle Herr erhält diese Sprucheffekte. Besitzer verliert 1 Tod-Element.

source: When summoned,deals 10 damage to creature in the opposite slot and two adjacent slots. Attacks Life units with additionial 5 damage. CAST:Casts Death Bolt, hitting enemy player with 7 of damage. Owner loses 5 Death. If owner`s Death becomes zero, he suffers 10 damage himself.
de: Wenn die Kreatur beschworen wird, fügt sie der Kreatur im gegnerischen und zwei angrenzenden Slots 10 Schaden zu. Greift lebende Einheiten mit zusätzlichen 5 Schadenspunkten an. Effekt wirken: Wirkt Todesbolzen, der den gegnerischen Spieler mit 7 Schaden trifft. Der Besitzer verliert 5 Tod-Elemente. Wenn der Vorrat an Tod-Elementen des Besitzers 0 erreicht, erleidet er selbst 10 Schaden.

source: Poisons all enemy units so that they lose health every turn, also hits them with 1 damage. Posion doesn`t affect undead.
de: Vergiftet alle gegnerischen Einheiten, so dass sie jede Runde Lebenspunkte verlieren, Außerdem trifft es sie mit 1 Schadenspunkt. Gift wirkt nicht gegen Untote.

source: Every enemy creature suffers damage equal to its attack -1
de: Jede feindliche Kreatur bekommt schaden in der höhe ihrer Stärke -1

source: Paralyzes enemy player and creatures for one turn, so they skip one turn.
de: Paralysiert Gegner und ihre Kreaturen für eine Runde, sodass diese Aussetzen müssen.

source: Each creature suffers up to 16 points of damage. If a player has Poseidon on a field, his creatures left unaffected. Amazingly poisonous magic storm, has no mercy to both friends and foes.
de: Jede Kreatur erleidet bis zu 16 Schadenspunkte. Wenn ein Spieler Poseidon auf dem Feld hat, bleiben seine Kreaturen unbeschadet. - Erstaunlich giftiger magischer Sturm, der keine Gnade kennt für Freund und Feind.

source: Inflicts 10 + Water/2 damage to enemy player. Caster suffers 6 damage as a side effect. Large bolt of Ice, fired at a great speed. Superior efficiency
de: Verursacht 10 + Wasser/2 Schaden am Gegenspieler. Als Nebeneffekt verliert der Zaubernde 6 Schaden. - Ein großer Eisbolzen, mit hoher Geschwindigkeit abgeschossen. Überlegene Effizienz.

source: All units on a field suffer 25 damage. Each player suffers 25 damage. The ultimate spell of the game. The strongest and most harmful. Beware, it's far too powerful!
de: Alle Einheiten auf dem Feld erleiden 25 Schaden. Jeder Spieler erleidet 25 Schaden. Der ultimative Zauberspruch des Spiels. Der Stärkste und Schädigendste. Doch vorsicht, er ist viel zu mächtig.

source: Each enemy creature suffers damage equal to owner's Fire + 3. As easy as it is - a ball of burning fire.
de: Jede gegnerische Kreatur erleidet Schaden in Höhe des Feuervorrats des Besitzers + 3. - So einfach ist das, ein Ball brennenden Feuers.

source: Deals 3 damage to each enemy creature. Cheap and still good. Pure Fire.
de: Verursacht 3 Schaden bei jeder gegnerischen Kreatur. - Billig und trotzdem gut. Reines Feuer.

source: If enemy has less Fire than owner does, enemy suffers damage, equal to this difference, multiplied by 2. Otherwise enemy suffers 1 damage. Now this is a smart one - a magic arrow made of pure Fire, never misses your foe.
de: Hat der Gegner mehr Feuer als der Besitzer, erleidet der Gegner Schaden in Höhe der Differenz multipliziert mit 2. Andernfalls erleidet der Gegner 1 Schadenspunkt. - Kleveres Teil - ein magischer Pfeil aus reinem Feuer, der Deinen Feind nie verfehlt.

source: Destroys all spell effects from all creatures, both owner's and enemy's. Heals all Fire creatures for 3.
de: Zerstört alle Sprucheffekte von allen Kreaturen, sowohl eigenen als gegnerischen. Heilt alle Feuerkreaturen um 3.

source: Winds away strongest enemy creature. Perfect against high-level enemy creatures. One of the most useful spells.
de: Bläst die stärkste gegnerische Kreatur fort. Perfekt gegen gegnerische Kreaturen mit höchsten Stufen. Einer der nützlichsten Zaubersprüche.

source: First enemy creature suffers damage equal to owner's Air+2. Lightning travels forth and hits each enemy creature, losing 2 damage each time it hits. For example, if owner has 10 Air and enemy has all 5 creatures, they suffer this damage (left to right): 12-10-8-6-4
de: Die erste gegnerische Kreatur erleidet Schaden entsprechend zum Luft-Elementarvorrat+2. Der Blitz wandert weiter und trifft jede gegnerische Kreatur, wobei er bei jedem Treffer 2 Schaden verliert. Verfügt der Besitzer beispielsweise über 10 Luft-Elemente und der Gegner hat alle 5 Kreaturen, erleiden sie (von links nach rechts): 12-10-8-6-4 Schaden.

source: Every creature on a field plagued - loses all hit points except one. Ignores all defences and modifiers. None shall escape the Plague! Great lands burnt to dust where the plague passed.
de: Jede Kreatur im Feld wird verpestet - verliert alle Lebenspunkte außer 1. Ignoriert alle Verteidigungen und Modifizierer. - Niemand wird der Pest entkommen! Riesige Landstriche, durch die die Pest zog, wurden zu staub verbrannt.

source: Owner's creatures become permanently immune to all damaging spells, spell effects, and poison. Remember that your creatures can no longer be affected by Bless, Restructure and other good spell effects.
de: Die Kreaturen des Besitzers werden dauerhaft immun gegen Schaden zufügende Sprüche, Sprucheffekte und Gift. Bedenk, dass Deine Kreaturen auch nicht mehr durch Segen=bless, Neugliederung=restructure und andere positive Sprucheffekte beeinflusst werden können.

source: Owner's creatures gain protection from all attacks. This defence only lasts one turn and lasts till next owner's turn. It's just like an unpenetrable wall has suddenly appeared. Anyone under your command will survive anything!
de: Die Kreaturen des Besitzers erhalten bis zu seiner nächsten Runde Schutz vor allen Angriffen. Es ist, als ob eine undurchdringliche Wand plötzlich auftaucht. - Irgendwer unter Deinem Befehl wird alles überleben.

source: Hits each creature for 15 damage. Doesn't affect owner's creatures, if onwer's Earth > 12. Even the earth itself is a powerful weapon.
de: Trifft jede Kreatur mit 15 Schaden. Schädigt nicht die Kreaturen des Besitzers, wenn sein Erde-Vorrat mehr als 12 beträgt. - Selbst die Erde selbst ist eine mächtige Waffe.

source: Kills all enemy creatures of level less than 5. Only the skilled one can survive the swamp's most dangerous weapon.
de: Tötet alle gegnerischen Kreaturen mit einer Stufe kleiner als 5. - Nur die Geschicktesten können die gefährlichste der Waffen des Sumpfes überleben.

source: All onwer's creatures gain +3 health to their maximum, healing for 6 in the same time. Scatter to pieces, connect once again. Now you are stronger, none shall remain!
de: Alle Kreaturen des Besitzers erhalten +3 Lebenspunkte zu ihrem Maximum und heilen gleichzeitig um 6. - Zerschmetter in Teile, verbinde zum Stück. Nun bist Du noch stärker und nichts bleibt zurück!

source: Heals all friendly creatures for 4. Gives owner 2 health for each of his creatures on a field. Heal me! Heal me!
de: Heilt alle eigenen Kreaturen um 4. Gibt dem Besitzer 2 Lebenspunkte für jede seiner Kreaturen auf dem Feld. - Heil mich! Heil mich!
