Repository: chubakur/wizards-magic2
Catalog: languages/*/LC_MESSAGES/cards.po
Languages: de

source: All owner's creatures Blessed: receive +1 to attack, restore 1 point of health every time they are hit. Undead creatures cannot be blessed and suffer 10 damage instead. Your army's now under God's protection, and your enemy is doomed forever!
de: Alle Kreaturen des Besitzers werden gesegnet: sie erhalten +1 Stärke und stellen jedes mal 1 Lebenspunkt wieder her, wenn sie getroffen werden. Untote Kreaturen können nicht gesegnet werden und erleiden stattdessen 10 Schaden. - Deine Armee steht nun unter Gottes Schutz und Dein Gegner ist für immer verdammt.

source: All undead on a field are destroyed. Owner receives 3 Life and 1 health for each destroyed creature. The great day of The Lord is near and coming quickly. That day will be a day of Wrath, a day of distress and anguish.
de: Alle Untoten auf dem Feld werden zerstört. Besitzer erhält 3 Leben und 1 Lebenspunkt für jede zerstörte Kreatur. - Der große Tag des Lords sind nah und nähern sich schnell. Dieser Tag wird ein Tag des Zorns sein, des Leids und der Qual.

source: Owner loses health equal to his Life. Enemy suffers damage, double of this amount. Sacrificing is the true loving act.
de: Sein Besitzer verliert Lebenspunkte in Höhe seines Vorrats an Leben. Der Gegner erleidet Schaden in doppelter Höhe. - Opfern ist der wahre Liebesakt.

source: If owner has Life creatures in play, heals owner for 5 and steals 4 health from each enemy creature, giving them to opposed owner's creature. Only pure souls can use God's blessings.
de: Wenn der Besitzer lebende Kreaturen im Spiel hat, wird er um 5 geheilt und stiehlt 4 Leben von jeder gegnerischen Kreatur, welche auf die ihnen gegenüber stehende Kreatur des Besitzers übertragen werden. - Nur reine Seelen können Gottes Segen nutzen.

source: Heals owner equal to his Life*3. Owner loses all Life elements. Blessed creatures heal for 3. Now you live again, mortal. Life is the most precious, be careful next time!
de: Heilt den Besitzer in Höhe seines Vorrats an Leben*3. Er verliert dabei alle Leben-Elemente. Gesegnete Kreaturen heilen um 3. - Nun lebst Du wieder, Sterblicher. Leben ist das Wertvollste, sei nächstes mal vorsichtig.

source: Banishes each creature into hell. Each banished creature gives caster 1 Death. Whenever one unfolds Chaos, no mortal can stand its fearful ugly nature.
de: Verbannt jede Kreatur in die Hölle. Jede verbannte Kreatur gibt dem Sprecher 1 Tod-Element. - Wann immer jemand das Chaos entfesselt, kann kein Sterblicher seiner furchteinflößenden hässlichen Natur widerstehen.

source: All living creatures suffer 13 damage. All undead creatures heal for 5. The Lord of Chaos most useful tool. Your army of darkness shall reign forever.
de: Alle lebenden Kreaturen erleiden 13 Schaden. Alle untoten Kreaturen heilen um 5. Des Herrn des Chaos nützlichstes Werkzeug. - Deine Armee der Finsterniss möge für immer herrschen.

source: Reduces all enemy elements by 1. Curse and Doom are now your enemy's only guests.
de: Reduziert alle Elemente des Gegners um 1. - Fluch und Verdammnis sind nun Deiner Gegner einzige Gäste.

source: If owner's Death less than 8, steals 5 health from enemy player. Otherwise steals Death + 5. Death's cold vampiric touch. So painful and surreal..
de: Wenn der Besitzer weniger als 8 Tod-Elemente besitzt, werden 5 Lebenspunkte vom Gegner gestohlen. Sonst werden Anzahl Tod-Elemente + 5 Lebenspunkte vom Gegner gestohlen. - Die kalte, vampirische Berührung des Todes. So schmerzhaft und unwirklich.

source: Every enemy creature suffers effect of Weakness: its attack decreased by 50% (rounded down). Make the strongest the weakest, and then assasinate him.
de: Jede gegnerische Kreatur leidet an Schwäche: ihre Stärke sinkt um 50% (abgerundet). - Mach aus dem Stärksten den Schwächsten, und meuchle ihn dann.
